# BuiltInFailures.SlabFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabFailures Class
BuiltInFailures Class Members See Also
---
Failures about Slab.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SlabFailures
```

Visual Basic
---
```text
Public NotInheritable Class SlabFailures
```

Visual C++
---
```text
public ref class SlabFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SlabFailures
# See Also
BuiltInFailures..::..SlabFailures Members
Autodesk.Revit.DB Namespace